***A. Creating Series and DataFrames***

In [99]:
# Lets create a pandas Series using a python list

#Step 1: Import pandas package

import pandas as pd

#Step2: Define a list
data = [1,2,3,4,5,6,7,8,9,10]


#Step3: Create the series
series = pd.Series(data)

# lets view the series that we have created
series.head(10)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [32]:
# lets confirm to be sure we had created a pandas series
type(series)

pandas.core.series.Series

In [33]:
# Lets create a series using the same list, but now we will be adding our own serial numbering, in python or pandas it is called index
series2 = pd.Series(data, index = ["a","b","c","d","e","f","g","h","i","j"])
series2.head(10)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [34]:
# Lets create a series using python dictionary


#lets create a python dictionary
data2 = {'a': 10, 'b': 20, 'c': 30}

# lets create the series
series3 = pd.Series(data2)
series3.head()

a    10
b    20
c    30
dtype: int64

**Creating a DataFrame**

In [35]:
# LEts create a dataframe
#Step1: import pandas

import pandas as pd

# Define the data using dictionary that is having its values as a list.

data = {
    'Name': ['Chris', 'Ayo', 'Chisom'],
    'Age': [26, 24, 22],
    'Home_Town': ['Benin', 'Ibadan', 'Enugu']
}

# Lets create the dataframe using "df" as short for dataframe
df = pd.DataFrame(data)
df.head()

     Name  Age Home_Town
0   Chris   26     Benin
1     Ayo   24    Ibadan
2  Chisom   22     Enugu

In [36]:
# lets do the samething by using list of dictionaries
data2 = [
    {'Name': 'Chris', 'Age': 26, 'Home_Town': 'Benin'},
    {'Name': 'Ayo', 'Age': 24, 'Home_Town': 'Ibadan'},
    {'Name': 'Chisom', 'Age': 22, 'Home_Town': 'Enugu'}
]
# LEts define the dataframe
df2 = pd.DataFrame(data2)
df2.head()

     Name  Age Home_Town
0   Chris   26     Benin
1     Ayo   24    Ibadan
2  Chisom   22     Enugu

In [37]:
# Lets do the sanething again using list of list

data3 = [
    ['Chris', 26, 'Benin'],
    ['Ayo', 24, 'Ibadan'],
    ['Chisom', 22, 'Enugu']
]
df3 = pd.DataFrame(data3, columns=['Name', 'Age', 'Home_Town'])
df3.head()

     Name  Age Home_Town
0   Chris   26     Benin
1     Ayo   24    Ibadan
2  Chisom   22     Enugu

In [38]:
# lets print the types to be sure we have defined dataframes
print(type(df))
print(type(df2))
print(type(df3))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [110]:
work = pd.read_csv("Untitled form.csv")
work

,Timestamp,First Name,Last Name,Course Track,City,Gender,Seat Number,PC-Make,PC - OS,Feedback
0,2025/09/11 12:55:34 PM GMT+1,Peter,Okonmah,AI,Ogun,Male,28,MACBOOK,Mac OS,non
1,2025/09/11 12:56:11 PM GMT+1,Toyeebat,Nababa,AI,Abeokuta,Female,24,HP,Windows,Excellent
2,2025/09/11 12:57:08 PM GMT+1,Perpetual,Meninwa,AI,Lagos,Female,22,HP,Windows,Thank you so much for the opportunity.
3,2025/09/11 12:57:56 PM GMT+1,Mahfuz,Abdulhameed,AI,Abeokuta,Male,44,HP,Windows,Amazing Shit
4,2025/09/11 12:58:41 PM GMT+1,Divine,Gbadamosi,AI,Abeokuta,Male,35,DELL,Windows,Brain Racking
5,2025/09/11 12:58:55 PM GMT+1,Abdulmalik,Adedotun,AI,Abeokuta,Male,200,HP,Windows,Enjoying the course so far
6,2025/09/11 12:58:55 PM GMT+1,Naheemot,Adebiyi,AI,Abeokuta,Female,32,DELL,Windows,Grateful for the opportunity to be here.
7,2025/09/11 12:59:00 PM GMT+1,Kanyisola,Fagbayi,AI;Data Science,Lagos,Female,00082,HP,Windows,One chin chin for you for this form
8,2025/09/11 12:59:16 PM GMT+1,Blessing,James,Cyber Security,Nairobi,Female,45678,HP,Windows,Thanks for creating the form.
9,2025/09/11 12:59:28 PM GMT+1,Hannah,Tanimola,AI,Abeokuta,Male,30,HP,Windows,On God
10,2025/09/11 12:59:41 PM GMT+1,Deborah,Adelegan,AI;Data Science,Abeokuta,Female,001,HP,Windows,None for now
11,2025/09/11 12:59:43 PM GMT+1,Esther,Kudoro,AI,Abeokuta,Female,1,HP,Windows,Chill
12,2025/09/11 1:00:03 PM GMT+1,Opeyemi,Odejimi,Cloud Computing,Abeokuta,Male,38,HP,Linux,Na wa
13,2025/09/11 1:00:13 PM GMT+1,Olasunkanmi,Rasak,AI,Kobape,Male,3,HP,Windows,My gratitude to the sponsor of this program an...
14,2025/09/11 1:00:27 PM GMT+1,Saheed,Olayinka,AI;Data Science;Web Dev,Abeokuta,Male,29,HP,Windows,None for now
15,2025/09/11 1:00:31 PM GMT+1,Kehinde,Akindele,Cloud Computing,Abeokuta,Male,54,Gateway,Windows,Great
16,2025/09/11 1:00:43 PM GMT+1,Oluwole,Oludayo,AI,Abeokuta,Male,09,HP,Windows,Good training to attend
17,2025/09/11 1:00:49 PM GMT+1,Samuel,Oyewusi,Web Dev,Lagos,Male,15,HP,Windows,Satisfactory
18,2025/09/11 1:00:54 PM GMT+1,Ademola,Akinrinde,AI,Abeokuta,Male,100,MACBOOK,Mac OS,Awesome shit\n\n
19,2025/09/11 1:01:31 PM GMT+1,Victor,Ademuyiwa,AI,kobape,Male,2,ASUS,Windows,Feels good
20,2025/09/11 1:01:44 PM GMT+1,Sherif,Okemakinde,AI,Abeokuta,Male,27,HP,Windows,Form filled
21,2025/09/11 1:01:46 PM GMT+1,Ayuba,Raji,AI,Abeokuta,Male,26,HP,Windows,None for now
22,2025/09/11 1:01:54 PM GMT+1,Hamid,Jimoh,AI,Ibadan,Male,299,DELL,Windows,I am curious
23,2025/09/11 1:02:28 PM GMT+1,Olajide,Abioye,AI,Abeokuta,Male,5,HP,Windows,"So far, i getting to familarize myself with nu..."
24,2025/09/11 1:02:49 PM GMT+1,Solomon,Olaiya,AI,Abeokuta,Male,16,MACBOOK,Mac OS,Delighted learning here
25,2025/09/11 1:02:56 PM GMT+1,Oluwadamilare,Bello,AI,Sango,Male,373,DELL;HP;LENOVO;MACBOOK;ASUS;,Mac OS,Coding is interesting when you understand
26,2025/09/11 1:02:59 PM GMT+1,Oluwaseyi,Egunjobi,Cloud Computing,Cape Town,Male,dirty,MACBOOK,Mac OS,Nice to meet you all
27,2025/09/11 1:03:12 PM GMT+1,Adeoye,Mary,AI,abeokuta,Female,15,LENOVO,Windows,Still processing
28,2025/09/11 1:03:36 PM GMT+1,Babatunde,Rahmon,AI,Abeokuta,Male,20,none,Windows,i actually have a pc that has a very low stora...
29,2025/09/11 1:06:03 PM GMT+1,Samuel,Dasaolu,AI,Abeokuta,Male,100,HP;MACBOOK,Linux,"Good so far, i guess"
30,2025/09/11 1:06:48 PM GMT+1,Gabriel,Bamgbose,AI,Abeokuta,Male,2,HP,Windows,Good
31,2025/09/11 1:10:16 PM GMT+1,Ridwanullah,Osho,AI;Cyber Security;Data Science,Abeokuta,Male,45,DELL,Windows,IT IS WHAT IT IS !!!
32,2025/09/11 1:11:39 PM GMT+1,Oluwapelumi,Adenuga,Web Dev,Abeokuta,Male,36,HP,Windows,live yours
33,2025/09/11 1:18:15 PM GMT+1,Michael,Osisami,AI,Abeokuta,Male,12,DELL;HP,Windows,Nil

***B. Data Input and Output***

In [39]:
# # Lets get to work...
# df = pd.read_csv('bio_data.csv')
# df.head()

# # Ensure to code along...

In [40]:
# LEts use all of this methods on our data



# Please, ensure to code along

***D. Data Cleaning***

In [41]:
# Do we have any missing values? if yes,lets fill them up

df.isna().sum()

# Ensure to code along

Name         0
Age          0
Home_Town    0
dtype: int64

***E. Data Selection and Filtering***

Viewing data columm

In [42]:
#bio_data_column = [irst_Name, Last_Name, City, Course_Track, PC_make, PC_Os, Feedback]

In [43]:
df.columns

Index(['Name', 'Age', 'Home_Town'], dtype='object')

Column selection

In [44]:
# lets look through a single column
df['Name']

# alternatively, we can use dot
df.Name

0     Chris
1       Ayo
2    Chisom
Name: Name, dtype: object

In [45]:
# Lets select multiple columns (correct way is to use a list of column names)
# Note: The current DataFrame 'df' only has columns: 'Name', 'Age', 'Home_Town'
df[['Name', 'Age']]

     Name  Age
0   Chris   26
1     Ayo   24
2  Chisom   22

In [46]:
# lets select more columns
df[['Name', 'Home_Town']]

     Name Home_Town
0   Chris     Benin
1     Ayo    Ibadan
2  Chisom     Enugu

Cell Selection

In [47]:
# lets select a single cell

df['Name'][0] # This will return the first value of the "Name" column

# lets try other methods for selecting cells
df.at[0, "Name"] # This will also return the first value of the "Name" column

# There is still another method using .iat[]
df.iat[0, 0] # This will return the first value of the first column(row0,column0)

'Chris'

Row selection

In [49]:
# Lets select some rows
df.iloc[0:5] # we are selecting from index 0 to the 5th index

     Name  Age Home_Town
0   Chris   26     Benin
1     Ayo   24    Ibadan
2  Chisom   22     Enugu

In [111]:
# combination of row and column selection
bio_data2.iloc[0:5, 0:3] # the first slice picks the rows and the second slice picks the columns

     City   CourseTrack    Name
0   Lagos  Data Science   Chris
1   Abuja            AI     Ayo
2   Lagos       Web Dev  Chisom
3  Ibadan  Data Science   Tunde

**Hands on practice**

Conditional Filtering

In [54]:
# Sample DataFrame with required columns to avoid errors
import pandas as pd

bio_data2 = pd.DataFrame({
	'City': ['Lagos', 'Abuja', 'Lagos', 'Ibadan'],
	'Course_Track': ['Data Science', 'AI', 'Web Dev', 'Data Science'],
	'Name': ['Chris', 'Ayo', 'Chisom', 'Tunde']
})

# Filter rows where City is 'Lagos'. This is going to return dataframe
filtered_lagos = bio_data2[bio_data2['City'] == 'Lagos']
filtered_lagos

    City  Course_Track    Name
0  Lagos  Data Science   Chris
2  Lagos       Web Dev  Chisom

In [55]:
# Sample DataFrame with required columns to avoid errors
import pandas as pd

bio_data2 = pd.DataFrame({
	'City': ['Lagos', 'Abuja', 'Lagos', 'Ibadan'],
	'Course_Track': ['Data Science', 'AI', 'Web Dev', 'Data Science'],
	'Name': ['Chris', 'Ayo', 'Chisom', 'Tunde']
})

# Filter rows where City is 'Lagos' and Course_Track is 'Data Science'
filtered_city = bio_data2[(bio_data2['City'] == 'Lagos') & (bio_data2['Course_Track'] == 'Data Science')]
print("Rows where City is 'Lagos' and Course_Track is 'Data Science':")
filtered_city

Rows where City is 'Lagos' and Course_Track is 'Data Science':

    City  Course_Track   Name
0  Lagos  Data Science  Chris

In [56]:
# Filter rows where City is either 'Lagos' or 'Abuja'
cities = ['Lagos', 'Abuja']
city_filtered = bio_data2[bio_data2['City'].isin(cities)]
print("Rows where City is either 'Lagos' or 'Abuja':")
city_filtered

Rows where City is either 'Lagos' or 'Abuja':

    City  Course_Track    Name
0  Lagos  Data Science   Chris
1  Abuja            AI     Ayo
2  Lagos       Web Dev  Chisom

Using the .query() method

In [58]:
# Add a Feedback column to bio_data2 for demonstration
bio_data2['Feedback'] = ['Good', 'Excellent', 'Poor', 'Average']

# Use query() to filter rows where Course_Track is 'AI' and Feedback is 'Excellent'
query_filtered = bio_data2.query("Course_Track == 'AI' and Feedback == 'Excellent'")
print("Rows filtered using query() method:")
query_filtered

Rows filtered using query() method:

    City Course_Track Name   Feedback
1  Abuja           AI  Ayo  Excellent

Rows filtered using query() method:

In [59]:
# Filter rows where Course_Track is 'Data Science'
data_science = bio_data2.query("Course_Track == 'Data Science'")
print("Students in the Data Science track:")
data_science

Students in the Data Science track:

     City  Course_Track   Name Feedback
0   Lagos  Data Science  Chris     Good
3  Ibadan  Data Science  Tunde  Average

Students in the Data Science track:

In [61]:
# Add a Seat_No column to bio_data2 for demonstration
bio_data2['Seat_No'] = [111, 109, 120, 105]

# Filter rows using multiple conditions with logical operators
webdev_high_seat_No = bio_data2.query("Seat_No > 110 and Course_Track == 'Web Dev'")
print("Web Dev students with Seat_No greater than 110:")
webdev_high_seat_No

Web Dev students with Seat_No greater than 110:

    City Course_Track    Name Feedback  Seat_No
2  Lagos      Web Dev  Chisom     Poor      120

Web Dev students with Seat_No greater than 110:

In [63]:
# Filter rows where City is either 'Lagos' or 'Abuja'
hp_dell = bio_data2.query("City in ['Lagos', 'Abuja']")
print("Rows where City is either Lagos or Abuja:")
hp_dell

Rows where City is either Lagos or Abuja:

    City  Course_Track    Name   Feedback  Seat_No
0  Lagos  Data Science   Chris       Good      111
1  Abuja            AI     Ayo  Excellent      109
2  Lagos       Web Dev  Chisom       Poor      120

Rows where PC_make is either HP or Dell:

In [64]:
# Define a variable for the course track
desired_track = 'Cloud Computing'

# Use the variable in the query expression
cloud_computing_students = bio_data2.query("Course_Track == @desired_track")
print("Students in the Cloud Computing track:")
cloud_computing_students

Students in the Cloud Computing track:

Empty DataFrame
Columns: [City, Course_Track, Name, Feedback, Seat_No]
Index: []

Students in the Cloud Computing track:

In [65]:
# Filter rows where Feedback is not 'Poor' and City is 'Lagos'
good_feedback_lagos = bio_data2.query("Feedback != 'Poor' and City == 'Lagos'")
print("Students in Lagos with Feedback other than 'Poor':")
good_feedback_lagos

Students in Lagos with Feedback other than 'Poor':

    City  Course_Track   Name Feedback  Seat_No
0  Lagos  Data Science  Chris     Good      111

Students in Lagos with Feedback other than 'Poor':

In [66]:
#LEts create a more complex query filter for Course_Track,Feedback and Seat_No
complex_query = bio_data2.query("Course_Track == 'Data Science' or (Feedback == 'Excellent' and Seat_No < 115)")
print("Complex query result:")
complex_query

Complex query result:

     City  Course_Track   Name   Feedback  Seat_No
0   Lagos  Data Science  Chris       Good      111
1   Abuja            AI    Ayo  Excellent      109
3  Ibadan  Data Science  Tunde    Average      105

***F. Data Transformation***

Renaming Column Name

In [70]:
# Lets modify the column names by fixing the old names as keys and the new name as values
# Use inplace=True to apply the changes to bio_data2
bio_data2.rename(columns={'Course_Track': 'CourseTrack', 'Seat_No': 'SeatNo'}, inplace=True)

# You can try renaming all the columns by removing all the underscores

Applying String Methods

In [72]:
# Lets apply some of the methods to our dataset
bio_data2["Feedback"] = bio_data2["Feedback"].str.lower() # Here we are converting everything to small letters.

In [74]:
# Add a PC_Os column for demonstration if it doesn't exist
if "PC_Os" not in bio_data2.columns:
	bio_data2["PC_Os"] = ["Windows", "Linux", "macOS", "Windows"]

# Convert the "PC_Os" column to upper case
bio_data2["PC_Os"] = bio_data2["PC_Os"].str.upper()
bio_data2.head()

     City   CourseTrack    Name   Feedback  SeatNo    PC_Os
0   Lagos  Data Science   Chris       good     111  WINDOWS
1   Abuja            AI     Ayo  excellent     109    LINUX
2   Lagos       Web Dev  Chisom       poor     120    MACOS
3  Ibadan  Data Science   Tunde    average     105  WINDOWS

In [76]:
# Lets convert the "Name" column to title case
bio_data2["Name"] = bio_data2["Name"].str.title() # Here we are converting the first letters to capital

In [78]:
#LEts view to see if it has applied
bio_data2.head()

     City   CourseTrack    Name   Feedback  SeatNo    PC_Os
0   Lagos  Data Science   Chris       good     111  WINDOWS
1   Abuja            AI     Ayo  excellent     109    LINUX
2   Lagos       Web Dev  Chisom       poor     120    MACOS
3  Ibadan  Data Science   Tunde    average     105  WINDOWS

In [ ]:
# LEts define a lambda function
lambda x: x.str.title()

# The .apply() method will help apply the function to the selected columns

bio_data2[col] bio_data[col].apply(lambda x: x.str.title())

SyntaxError: invalid syntax (2748587307.py, line 6)

In [81]:
#LEts view to see if it has applied
bio_data2.head()

     City   CourseTrack    Name   Feedback  SeatNo    PC_Os
0   Lagos  Data Science   Chris       good     111  WINDOWS
1   Abuja            AI     Ayo  excellent     109    LINUX
2   Lagos       Web Dev  Chisom       poor     120    MACOS
3  Ibadan  Data Science   Tunde    average     105  WINDOWS

In [ ]:
# We can decide to apply the lambda funtion to every element in the dataset
bio_data.applymap(lambda x: x.str.title())
bio_data.head()

NameError: name 'bio_data' is not defined